of-6/OpenFOAM-6-master/tutorials/heatTransfer/chtMultiRegionFoam/reverseBurner/system/gas/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    ignition;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (0.01 0.1 -0.01) (0.02 0.11 0.01);
        }
    }
);

// ************************************************************************* //
